0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	
	version		4.0;
	format		ascii;
	class		volVectorField;
	location	"0";
	object		U;
	
}

Uinlet          (0 10 0);

dimensions [0 1 -1 0 0 0 0];

internalField		uniform (0 0 0);
boundaryField
{
	
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }
	
	 #includeEtc "caseDicts/setConstraintTypes"
}

