0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		alphat;
	
}

dimensions [0 2 -1 0 0 0 0];
internalField		uniform 0;
boundaryField
{
	
	inlet
	{
		type	calculated;
		value	uniform 0;
		
	}
	outlet
	{
		
		type	calculated;
		value	uniform 0;
	}

    wall
    {
   		type		alphatJayatillekeWallFunction;
		value uniform		0;
		Prt		0.85; //default
	}

	
	 #includeEtc "caseDicts/setConstraintTypes"

}

