0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		p_rgh;
	
}

dimensions [0 2 -2 0 0 0 0];
internalField		uniform 0;
boundaryField
{

 inlet
    {
		type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    outlet
    {

        type            totalPressure;
		rho             none;
		p0              uniform 0;
		value           uniform 0;
    }

    wall
    {
		type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }


	 #includeEtc "caseDicts/setConstraintTypes"
	
}

