constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"constant";
	object		turbulenceProperties;
	
}

simulationType		RAS;
RAS
{
	
	RASModel		RNGkEpsilon;
	turbulence		on;
	printCoeffs		on;
	
}

