system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	
	version		4.0;
	format		ascii;
	class		dictionary;
	location		"system";
	object		controlDict;
	
}

application		buoyantBoussinesqSimpleFoam;
startFrom		latestTime;
startTime		0;
stopAt		endTime;
endTime		400;
deltaT		1;
writeControl		timeStep;
writeInterval		1;
purgeWrite		2;
writeFormat		binary;
writePrecision		6;
writeCompression		off;
timeFormat		general;
timePrecision		6;
runTimeModifiable		true;
functions
{
	
	
}

