system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		decomposeParDict;
	
}

numberOfSubdomains		6;
method		scotch;
simpleCoeffs
{
	
	n (3 2 1);
	delta		0.001;
	
}

hierarchicalCoeefs
{
	
	n (3 2 1);
	delta		0.001;
	order		xyz;
	
}

manualCoeffs
{
	
	dataFile		cellDecomposition;
	
}

