system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSchemes;
	
}

ddtSchemes
{
	
	default		steadyState;
	
}

gradSchemes
{
	
	default		cellLimited leastSquares 1;
	
}

divSchemes
{
	
	default		none;
	div(phi,epsilon)		bounded Gauss linearUpwind grad(epsilon);
	div(phi,U)		bounded Gauss linearUpwindV grad(U);
	div((nuEff*dev2(T(grad(U)))))		Gauss linear;
	div(phi,k)		bounded Gauss linearUpwind grad(k);
	div(phi,T)		bounded Gauss linearUpwind default;;
	
}

laplacianSchemes
{
	
	default		Gauss linear limited corrected 0.333;
	
}

interpolationSchemes
{
	
	default		linear;
	
}

snGradSchemes
{
	
	default		limited corrected 0.333;
	
}

fluxRequired
{
	
	default		no;
	
}

