system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSolution;
	
}

solvers
{
	
	p_rgh
	{
		
		relTol		0.01;
		tolerance		1E-08;
		nSweeps		0;
		smoother		GaussSeidel;
		solver		PCG;
		preconditioner		FDIC;
		
	}
	
	T
	{
		
		relTol		0.1;
		tolerance		1E-08;
		nSweeps		1;
		smoother		GaussSeidel;
		solver		smoothSolver;
		preconditioner		FDIC;
		
	}
	
	U
	{
		
		relTol		0.1;
		tolerance		1E-08;
		nSweeps		1;
		smoother		GaussSeidel;
		solver		smoothSolver;
		preconditioner		FDIC;
		
	}
	
	k
	{
		
		relTol		0.1;
		tolerance		1E-08;
		nSweeps		1;
		smoother		GaussSeidel;
		solver		smoothSolver;
		preconditioner		FDIC;
		
	}
	
	epsilon
	{
		
		relTol		0.1;
		tolerance		1E-08;
		nSweeps		1;
		smoother		GaussSeidel;
		solver		smoothSolver;
		preconditioner		FDIC;
		
	}
	
	
}

SIMPLE
{
	
	nNonOrthogonalCorrectors		2;
	residualControl
	{
		
		nut		0.0001;
		p_rgh		0.0001;
		k		0.0001;
		U		0.0001;
		T		0.0001;
		epsilon		0.0001;
		alphat		0.0001;
		
	}
	
	pRefValue		0;
	pRefPoint (52.0617844257404 -102.146512499327 26);
	
}

relaxationFactors
{
	
	k		0.7;
	U		0.7;
	epsilon		0.7;
	p_rgh		0.3;
	T		0.5;
	
}

