system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{

	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		surfaceFeatureExtractDict;

}

wallSTL.stl
{

	extractionMethod		extractFromSurface;
	extractFromSurfaceCoeffs
	{

		includedAngle		150;

	}

	writeObj		yes;

}
